---
kind: property
id: P:Autodesk.Revit.DB.Visual.Wave.WaveDistribution
source: html/c456cdc0-3fcc-1c68-0395-c1622e896d1b.htm
---
# Autodesk.Revit.DB.Visual.Wave.WaveDistribution Property

The property labeled "Distribution" from the "Wave" schema.

## Syntax (C#)
```csharp
public static string WaveDistribution { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "WaveDistributionType".